backend/app/models/refresh_token.rb

  def self.issue_for(user)
    raw = SecureRandom.hex(64)
    user.refresh_tokens.create!(
      token: digest(raw),
      expires_at: JwtService::REFRESH_TOKEN_TTL.from_now
    )
---
INSERT INTO "refresh_tokens" ("user_id", "token", "expires_at", "revoked", "created_at", "updated_at") VALUES (3, '2e0fdb27152bad923df266ecf7f2535bf9a73ecfbeda10eda95f7c9fa244b6ff', '2026-06-03 23:24:06.141913', FALSE, '2026-05-04 23:24:06.146957', '2026-05-04 23:24:06.146957') RETURNING "id"