backend/app/controllers/api/v1/auth/password_resets_controller.rb

        def create
          user = User.find_by(email: params[:email]&.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'novo@test.com' LIMIT 1

        def update
          user = User.find_by_token_for(:password_reset, params[:token])

          unless user
            return render json: { error: I18n.t("auth.password_reset.invalid_token") }, status: :unprocessable_content
          end

          if user.update(password_params)
            user.refresh_tokens.update_all(revoked: true)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2026-05-05 02:13:16.268673"], ["id", 3]]
UPDATE "refresh_tokens" SET "revoked" = $1 WHERE "refresh_tokens"."user_id" = $2  [["revoked", true], ["user_id", 3]]