backend/app/controllers/api/v1/auth/refresh_controller.rb

        def create
          if params[:refresh_token].blank?
            return render json: { error: I18n.t("auth.invalid_refresh_token") }, status: :unauthorized
          end

          record = RefreshToken.includes(:user).find_by(token: RefreshToken.digest(params[:refresh_token]))
---
SELECT "refresh_tokens".* FROM "refresh_tokens" WHERE "refresh_tokens"."token" = 'fd9127f809d54aed14d9cb8c6fe0f5248baab0ac48c523011a4eed20c37dd2dd93630c8b685e2c83cbdfa245a4c4f101e99a06361453726a622793bfd031ff18' LIMIT 1
SELECT "refresh_tokens".* FROM "refresh_tokens" WHERE "refresh_tokens"."token" = 'e30ebd2e931152d43d816e3abedc0630e7fcf5b0a1873c8b0842a0f2a3b11894' LIMIT 1