backend/app/controllers/api/v1/auth/registrations_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('Eduardo', 'eduardo@test.com', '$2a$12$C1wQB8kkdGewnD/X3OcnyOVUmzaVGG7N98rPio4UbgHUMCpK9BOBC', '2026-05-03 01:32:56.157881', '2026-05-03 01:32:56.157881') RETURNING "id"
---
        def create
          user = User.new(registration_params)

          if user.save