backend/app/controllers/api/v1/auth/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'novo@test.com' LIMIT 1
---
        def create
          user = User.find_by(email: params.dig(:user, :email)&.downcase)

SELECT "refresh_tokens".* FROM "refresh_tokens" WHERE "refresh_tokens"."user_id" = 463 AND "refresh_tokens"."token" = '7267a3561405768e98abbede2f1bdcad0d5af180ad4bf5698bf5f82524bb8194' LIMIT 1
---
        def destroy
          record = current_user.refresh_tokens.find_by(token: RefreshToken.digest(params[:refresh_token]))