backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def authenticate_user!
    token = request.headers["Authorization"]&.split(" ")&.last
    raise JwtService::AuthenticationError, I18n.t("auth.token_missing") unless token

    payload = JwtService.decode(token)
    @current_user = User.find(payload[:user_id])