backend/app/controllers/api/v1/notes_controller.rb

      def index
        notes = current_user.notes
        notes = notes.search_by_title(params[:q]) if params[:q].present?
        notes = notes.order(created_at: :desc).page(params[:page]).per(9)
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 4 ORDER BY "notes"."created_at" DESC
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = 3
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 3 AND (title ILIKE '%test%') ORDER BY "notes"."created_at" DESC LIMIT 10 OFFSET 0

      def create
        note = current_user.notes.build(note_params)

        if note.save
---
INSERT INTO "notes" ("user_id", "title", "content", "created_at", "updated_at") VALUES (3, 'Minha primeira nota', 'Conteúdo da nota aqui.', '2026-05-03 22:58:42.201603', '2026-05-03 22:58:42.201603') RETURNING "id"

      def update
        if @note.update(note_params)
---
UPDATE "notes" SET "content" = 'Conteúdo da nota aqui. teste edição', "updated_at" = '2026-05-04 21:17:31.300595' WHERE "notes"."id" = 1

      def set_note
        @note = current_user.notes.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 3 AND "notes"."id" = 1 LIMIT 1